package com.homeworks;

public class Operators {
    /*+ - плюс
    - - минус
    = - назначение
    % - остаток от деления
    / - деление
    * - умножение
    == - равно
    комбинированные операторы --------
    += - x = x + переменная
    -= - тоже самое только -
    *=
    /=
    %=
    Инкремент ++ - увеличивает на 1
    Декремент -- - уменьшает на один
    + положительное число
    - отрицательное число
    a++ - сначала выражение, потом увеличивается
    ++а - сначала увеличивается, потом выражение
    а-- - тоже самое только -
    --а - тоже самое только -

    == - равно
    != - не равно
    > - больше
    < - меньше
    >= - больше или равно
    <= - меньше или равно

    логические операции
    && - и
    || - или
    ! - отрицание
    & - побитовое и
    | - побитовое или
    ^ - побитовое исключающее ИЛИ*/
}
